####################################################################################################
##             Source code for the "Demo" program for a computer made of logic arrows             ##
##              Исходный код программы "Demo" для компьютера из логических стрелочек              ##
##                  https://github.com/chubrik/LogicArrows/tree/main/computer-v2                  ##
##                          (с) 2024 Arkadi Chubrik (arkadi@chubrik.org)                          ##
####################################################################################################


            jmp title               ; Прыгаем через строку
text    db  "!иригинО\n,тевирП"     ; Строка "Привет,\nОнигири!" задом-наперёд

title:      ldi b, "\n"
            st b, 0x01              ; Дополняем строку
            ldi b, title -1
            ldi c, 0x3C             ; Адрес вывода в терминал
            ldi d, loop

loop:       ld a, b
            st a, c
            dec b
            jnz d

            hlt

void1   db  0, 0, 0, 0, 0, 0, 0, 0, ; Заполняем пустыми байтами до адреса 0x3D
            0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0

in_out  db  0b_00000101             ; Порт вывода, подключён дисплей и терминал

void2   db  0

display db  0b00000000, 0b00000000, ; Картинка для дисплея в области 0x40...0x5F
            0b00000000, 0b00000000,
            0b00000000, 0b00000000,
            0b00000010, 0b10000000,
            0b00111011, 0b10111000,
            0b00100101, 0b01001000,
            0b00100011, 0b10001000,
            0b00100001, 0b00001000,
            0b00010001, 0b00010000,
            0b00001101, 0b01100000,
            0b00010001, 0b00010000,
            0b00010011, 0b10010000,
            0b00001101, 0b01100000,
            0b00000000, 0b00000000,
            0b00000000, 0b00000000,
            0b00000000, 0b00000000
