####################################################################################################
##             Source code for the "Demo" program for a computer made of logic arrows             ##
##              Исходный код программы "Demo" для компьютера из логических стрелочек              ##
##                  https://github.com/chubrik/LogicArrows/tree/main/computer-v2                  ##
##                          (с) 2024 Arkadi Chubrik (arkadi@chubrik.org)                          ##
####################################################################################################


                jmp title               ; Переходим через строку
text        db  "!иригинО\n,тевирП"     ; Строка "Привет,\nОнигири!" задом-наперёд

title:          ldi b, "\n"
                st b, 0x01              ; Дополняем строку
                ldi b, title -1
                ldi c, 0x3C             ; Адрес для вывода в терминал
                ldi d, loop

loop:           ld a, b
                st a, c
                dec b
                jnz d

                ldi a, "\a"             ; Код команды "звонок" у терминала
                st a, c                 ; Активируем звонок, у терминала загорается колокольчик
                st a, c                 ; Снова активируем звонок, но в этот раз колокольчик гаснет.
                                        ;   Терминал устроен так, что колокольчик гаснет при любом
                                        ;   дальнейшем вводе, в т.ч. повторном "\a".
                st a, c
                st a, c
                st a, c                 ; Зажигаем колокольчик в третий раз и оставляем

                hlt

void        db  0, 0, 0, 0, 0, 0, 0, 0, ; Заполняем пустыми байтами по адрес 0x3D
                0, 0, 0, 0, 0, 0, 0, 0,
                0, 0, 0, 0, 0, 0

in_out      db  0b00001101              ; Порт вывода, подключён цветной дисплей и терминал
bank        db  0                       ; Порт банка памяти (не используется)

; Область 0x40...0x5F содержит красный компонент заставки, отображаемой на дисплее во время загрузки
; программы
display_r   db  0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000010, 0b10000000, ;             ██  ██               ;
                0b00111011, 0b10111000, ;     ██████  ██████  ██████       ;
                0b00100101, 0b01111000, ;     ██    ██  ██  ████████       ;
                0b00100011, 0b11111000, ;     ██      ██████████████       ;
                0b00100001, 0b11111000, ;     ██        ████████████       ;
                0b00010001, 0b11110000, ;       ██      ██████████         ;
                0b00001101, 0b11100000, ;         ████  ████████           ;
                0b00010001, 0b11110000, ;       ██      ██████████         ;
                0b00010011, 0b11110000, ;       ██    ████████████         ;
                0b00001101, 0b01100000, ;         ████  ██  ████           ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000  ;                                  ;

; Область 0x60...0x7F содержит синий компонент заставки, отображаемой на дисплее во время загрузки
; программы
display_b   db  0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000010, 0b10000000, ;             ██  ██               ;
                0b00111011, 0b10111000, ;     ██████  ██████  ██████       ;
                0b00111101, 0b01001000, ;     ████████  ██  ██    ██       ;
                0b00111111, 0b10001000, ;     ██████████████      ██       ;
                0b00111111, 0b00001000, ;     ████████████        ██       ;
                0b00011111, 0b00010000, ;       ██████████      ██         ;
                0b00001111, 0b01100000, ;         ████████  ████           ;
                0b00011111, 0b00010000, ;       ██████████      ██         ;
                0b00011111, 0b10010000, ;       ████████████    ██         ;
                0b00001101, 0b01100000, ;         ████  ██  ████           ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000, ;                                  ;
                0b00000000, 0b00000000  ;                                  ;
