####################################################################################################
##          Source code for the "Typewriter" program for a computer made of logic arrows          ##
##           Исходный код программы "Typewriter" для компьютера из логических стрелочек           ##
##                  https://github.com/chubrik/LogicArrows/tree/main/computer-v2                  ##
##                          (с) 2024 Arkadi Chubrik (arkadi@chubrik.org)                          ##
####################################################################################################


        inc a           ; 0b_00000001
        ldi b, 0x3E     ; Порт ввода/вывода
        st a, b         ; Подключаем терминал
        ldi c, 0x3C     ; Адрес вывода в терминал
        ldi d, loop     ; Адрес для повторения итерации

loop:   ld a, b         ; Читаем код нажатой клавиши
        st a, c         ; Отправляем в терминал
        jmp d           ; Повторяем итерацию
